{"reviewFull":"Three different friends recently recommended the Netflix dramatization for this book to me so I thought I'd read the book first before checking out the TV series.\nI was quite surprised by the beginning of this book. Not because of the events described from the Chinese Cultural Revolution (I am well aware of the atrocities that happened then), but because a Chinese author dared to portray them very negatively - to the point where the insanity of that period apparently leads to the annihilation of the human race by an alien civilisation! And what's more, the author <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Galaxy_Award_(China)\">won China's most prestigious science fiction award</a> for this book! I always thought of China as a place with zero tolerance for any dissent - with their great firewall, and well documented abuses of human rights when citizens say something off limits. So I'm not sure what to make of this book being so openly praised by the Chinese establishment. Maybe the <a target=\"blank\" href=\"https://en.wikipedia.org/wiki/Chinese_Communist_Party\">CCP</a> is distancing itself from some of its horrendous past? Or maybe this book was just too good not to give it an award? Maybe this being a fantastical work of fiction renders it non-threatening to the establishment? Or maybe Liu Cixin has connections that keep him safe? Who knows...\nAnyway, the book is excellent. The characters are complex and unpredictable, the story is gripping and mysterious, and the science fiction is very creative. Perhaps the only critique I have is that it seems unlikely that a planet could orbit 3 suns like some kind of football being kicked around between 3 players. I haven't given this much thought but my assumption is that the planet would pretty quickly get pulled into one of the suns and die a fiery death. But who knows. And it is such a cool idea - a planet orbiting 3 suns - that I just suspended my disbelief and enjoyed the ride.\nI loved the descriptions towards the end, of the unfolding of the proton into various dimensions. And how the Trisolarans printed circuits onto it to create a \"sophon\".\nThe character development was very perceptive, but I did feel it was a little lacking in depth. I think the author should have spent more time building up the character of Ye Zhetai before his public execution. While this scene did make me angry, I felt like it could have been even more devastating for the reader if the author had built up a stronger relationship of love and respect for him. A couple more chapters of his earlier life - his hopes, dreams, good times, struggles overcome - would have had the reader bawling their eyes out at his public execution! And likewise for his daughter Ye Wenjie. We're not even introduced to her until after her father's execution! That's a wasted opportunity. Why not tell us first about her happy family life, her relationship with her parents, the confusing events she sees but does not understand, the internal conflicts between what her father teaches her at home and what she is taught in Marxist classes at school, her struggles with cognitive dissonance? Some of these things were briefly mentioned but in quite a detached, non-personal way. Anyway, it was still a great book, but I think it could do with a prequel to be read first."}