{"reviewFull":"An interesting book that discusses the nature of start-ups and the surrounding business ecosystem. This book should not be read as an instruction manual, but rather as a high-level guide to help entrepreneurs find their niche.\nWhen I started this book I made the mistake of taking it too literally. Peter Thiel writes using big sweeping non-falsifiable statements regarding the nature of business and technology, as well as giving his predictions about the future. To analyse such statements is impossible and if you try this, you'll find this book a frustrating experience. Instead, you should glean the big ideas from this book and see if they ring true or not.\nIt may not be clear why I say this, so here is an example of how not to read this book: take the opening statement of the book, \"Every moment in business happens only once. The next Bill Gates will not create an operating system.\" Taken literally of course this is true - in fact every moment in history happens only once - even a robot performing a repetitive task does each iteration at a new point in time. But from the context, the author is not talking in a strictly literal sense about physics. He is talking about new inventions. But different businesses do often create similar technologies - MySpace and Facebook, Windows and Linux, EVs and fossil fueled cars. Depending on the focus of a technology it may appear new or old, for example modern EVs use Lithium ion batteries - that's new, but then still have the traditional 4 wheels, a chassis, seats, etc.\nThe central premise of the book is that creating something new is \"0 to 1\". This rings true. Despite the fact that a new invention tends to build upon old technologies, there is always a unique idea present that previously did not exist. It is often just a clever way of combining existing technologies - eg. the electric drill (hand drill + electric motor). Nevertheless, because the invention is new, something has come into being that did not previously exist. In rare cases a new technology can even come about via simplification - like how the unicycle was developed by removing a lot of parts from a bicycle and reconfiguring the rest. So \"0 to 1\" may not be the best term to describe the phenomena of invention, but it gets across the broad point.\nChapter 1 proposes a question to help entrepreneurs develop a unique business idea: \"What important truths do very few people agree with you on?\". This is an interesting way to come up with controversial ideas, many of which will doubtless be groundbreaking. But in my opinion a new  invention need not be controversial to be successful and to push humanity forward. I remember many technologies invented during my lifetime that were widely expected to succeed and did indeed succeed - for example the DVD player, electric vehicles, and the digital camera. Of course, the most memorable new inventions are more controversial - the first aircraft, the internet, artificial intelligence in certain contexts, etc. But the world needs solutions to mundane problems as well as grandiose ones, so I would say not to limit oneself to the question \"What important truths do very few people agree with you on?\" when developing a start-up idea. Maybe a better question would be, \"What useful thing do you see missing from the world?\". But then, Peter Thiel has far more experience with start-ups than I do, so maybe he's onto something.\nChapter 2 discussed asset bubbles, but in my opinion completely missed the mark. Bubbles always have the same underlying financial cause - an abundance of cheap credit.\nChapter 3 contained a lot of good material. It discusses the necessity of profits, rather than revenues in business and how aiming for monopoly status is the surest way to achieve this. This is because competition tends to eliminate profits over time. Controversially Thiel claims that monopolies are not only good for the company in question, but also for consumers, since they create something new of value. In my opinion, this misses the critique that most economists have of monopolies. The question is not so much whether they improve the world, but whether the world would be even better with more competition.\nAnd personally I think that to ask whether monopolies are good or bad is a bit of a red herring. There are more fundamental ethical criteria that ought to be applied to business, and so long as these are satisfied then we can say that the resulting business is at least \"not bad\" (though this would not necessarily mean it is good either). Here are a few examples of the hundreds of such criteria I would apply:<ul><li>Don't use the legal system to gain an advantage in business</li><li>Interest rates should not be used as a tool to promote one type of business over another</li><li>Copying an idea is good - it shares knowledge and results in technological progress</li></ul>And of course, the world today does not operate upon these principles, so its hard to say if monopolies would emerge if it did.\n\nTo be continued..."}