{"reviewFull":"I absolutely love this movie. It's a total rollercoaster of emotions woven into an excellent dance soundtrack with Thailand's crowded cities and stunning natural scenery for a backdrop. Ok I think the director did not intend for me to like the congested street scenes, but I did nonetheless. I have always been drawn to bustling urban squalour - at least as an outside observer.\nThe movie is a tale of new friendships and betrayals, of true love vs hedonism, and of the <a target=\"_blank\" href=\"https://scholar.google.com.au/scholar_url?url=https://www.academia.edu/download/51428808/j.futures.2008.11.01920170119-2294-r0i8rd.pdf&hl=en&sa=X&ei=K9BwYYulBOaM6rQPv6mCkAI&scisig=AAGBfm1AqW7mY5SC_L_D8SCvPeiXOI1RfA&oi=scholarr\">Paradox of Tourism</a>\nRichard (Leonardo DiCaprio) is a tourist in Thailand. He is in search of a genuine travel experience. Not the standard tourist experience - sold as a neat little package at the travel agent, but the real deal - off the beaten path, breathtaking and exciting. His mad neighbour (Begbie from Trainspotting) tells him of an uninhabited island with beautiful white sands, palm trees and crystal clear waters. He even draws Richard a map of how to get there. Richard convinces a French couple - Etienne and Francoise - to come with him.\nThey find the island and at first it appears to be paradise. It is inhabited on one side by a troupe of hippies, and on the other by a troop of machine-gun toting weed farmers. With some luck, Richard and co evade the mercenaries and sign up with the hippie commune on the far side of the island.\nDespite being the protagonist, it soon becomes clear that Richard is actually the villain of this movie. Etienne, his French rival, is the real hero. Richard has an affair with Etienne's girlfriend Francoise, and although Etienne is mad about this he tells Richard that he wants Francoise to be happy and so he lets her go. Later on Richard cheats on her so she dumps him.\nRichard offers corny generalisations about life throughout the movie, but his stance as the villain gives these a sour feel.\nTheir island hideaway is as close to a natural paradise as can be and for a long while times are good. They catch fish from the lagoon, play sports on the beach, and hang out as a big group, enjoying each other's company. But nature also has a cruel side. A shark attack leaves 2 members of the group dead via disembowelment and a third mortally wounded. The dying man teeters on the brink of death for more than a week before the hedonistic hippies get tired of his moans and carry him out to die quietly away from their camp. Etienne is the only one who stays to look after him, while Richard selfishly sneaks back later to suffocate the dying man.\nThe main theme of <i>The Beach</i> is the <i>Paradox of Tourism</i> and the protagonists' attempts to circumvent it. Travel and exploration are all about discovering untarnished places and having authentic experiences there. The last thing a tourist wants is to feel they are being served a cheap imitation in a place just like home. But therein lies the paradox - the more pristine the place, the greater it's touristic pull, and then paradise becomes overcrowded and loses its allure.\nFoiling the paradox requires either secrecy or force. The protagonists fail at the former strategy - thanks again to Richard who tells some stoners the location of the island - so this leaves only the force option. In the end the mercenaries gun down the stoners and demand that Richard be killed for bringing tourists to their island. Sal (the hippie leader, played by Tilda Swinton) considers this a price worth paying and pulls the trigger. At this point the group packs up and leaves. Paradise was nice and all but not when shared with a bunch of murderers."}