{"reviewFull":"This is probably my favourite show of all time. It tells a story as old as the dawn of civilization - mankind's struggle for survival against dangerous predators in an unfamiliar environment. A deadly virus is resurrecting people as zombies and anyone who gets bitten or scratched will \"turn\" within a few hours.\nI think <i>The Walking Dead</i> is such a good show because it has all 5 essential elements of a good story - complex characters, a unique and memorable setting, a driving plot, meaningful conflict and a theme. Later seasons put more emphasis on the characters, plot and theme, but Season 1's main focus is on the setting and conflict. This series is quite extreme, so the setting and conflict are really pushed to their limits.\n<i>Setting</i>\nThe protagonists have set up camp on the outskirts of Atlanta and are making frequent supply-runs to the abandoned city. It is these trips that interest me most. The urban landscape has not changed - physically it's all still there - streets, bridges and buildings. But the way that humans interact with the city is now totally different. This is both because their life goals have been completely upended by the zombie apocalypse and because society and all its rules are gone.\nBuildings that served a purpose for people in the old world take on a totally different purpose in a zombie apocalypse. A tall department store in the middle of Atlanta is no longer a bustling hive of commercial activity - instead the focus is on its rooftop, which provides a lookout over the windswept city for surrounding zombie hordes. A hospital is no longer a place to go to be treated for illness - with zombies roaming the hallways it is now a claustrophobic deathtrap to be escaped from immediately. And a sewer is no longer a tunnel that carries away the city's refuse, but a convenient way to get straight to the centre of the city while bypassing street level hazards.\nNowhere is off limits and everywhere is accessible - the protagonists just smash open any door that gets in their way, freely taking anything they encounter along the way. But of course the things they used to value are no longer high priorities in a zombie apocalypse. Looting a jewelry store would be easy, but this thought never even occures to them. Their immediate needs are food, water, medicine and weapons - right down the bottom of Maslow's Hierarchy of Needs. Even a brand new Ford Mustang is more valuable when stripped for spare parts to keep a camper van and 4WDs running.\n<i>Conflict</i>\nAs you would expect, in Season 1 the zombies are the main enemy. In later seasons the protagonists actually face more deadly enemies than zombies, but at this point they are still a new and formidable foe. The protagonists are constantly fighting for survival against the zombies. Sometimes they succeed and sometimes members of the group are viciously bitten and die. Some of those they lose are characters the series has spent a long time developing - their interests, their history, their likes and dislikes, and their moral code. This makes their loss all the more upsetting. A big pull of this show is to watch and root for favourite characters to succeed and improve their post-apocalyptic lives.\nI had already seen later seasons before writing this review but I went back to re-watch this season and I found it striking just how unskilled and unprepared they are at fighting off zombies at the start. Whereas in later seasons one human could fairly easily take out 5 zombies at a time, in this season many people die from an attack by a single zombie. They have to learn the most effective defense against the zombies and they are unsuccessful more often than not. It is as if the lights of the old world went out, and humans are left groping around in the dark while a new enemy attacks them in ways they've never encountered before. Those that do survive do so mainly by luck at first. At this point they are killing zombies with rocks, branches, baseball bats and noisy guns, which attract more zombies - unlike the knives and swords they use in later seasons (which are both silent and sustainable). Only Darrell's technique of shooting zombies in the head with a crossbow is unchanged from later seasons.\nLater seasons of this show are very political, but that is not the case with this season. The characters here exist in what can honestly be described as a Hobbesian <i>state of nature</i> - life is quite solitary in contrast to the crowding of the old world, and certainly very poor, nasty, brutish and short."}