{
    "notes": "put all book data here",
    "data": [
        {
            "author": "Stanislaw Lem",
            "title": "Solaris",
            "year": 1961,
            "rating": 4,
            "spoilers": true,
            "thumbnail": "https://images.gr-assets.com/books/1498631519l/95558.jpg",
            "reviewTitle": "Minimalist sci-fi",
            "review": "Points for creativity and originality. I liked the conscious \"plasmic\" ocean concept. And the idea that an alien might not communicate with humans in a way that could ever make sense to us. Also points for character development and plot development. Snout initially appears crazy and then circumstances show him to be the sanest of them all. It was nice to have one’s prejudices conjured and then corrected and it was nicely done. I also liked the air of mystery - things left unsaid: we never learn what visitors Snout and Sartorious receive, yet we are given snippets of conversations and evidence of bloody struggles, with little said about what went down. Further points added for the protagonists thoughts becoming material realities visible to others.\nHowever, I deducted points for a bit of a bland plot taking place all in one location (though it is a very interesting location - a foreign planet). At times it almost felt like the author was trying to be deliberately minimalistic - to see how interesting a book he could write using as little change in location and as few characters as possible.\nThe book raised some interesting philosophical questions and proposed some novel scientific methods for practically answering them - how do you know if you are dreaming? Try calculating something using a computer that would be beyond the capabilities of your brain, but easy for a computer. Though this is not foolproof since if you are dreaming you might just think the answer is correct, even if it is completely made up by your brain.\nI deducted further points when Kelvin brings up <i>god</i> in the final chapter. It seemed unnecessary and corny. Snout says, \"that's bad philosophy. It's even bad mysticism\" then changes his mind. I think his original reaction was correct. Though maybe it says something about the weakness of the human mind to always fall back on the tired old trope of a god, whenever some organism that is more intelligent or unexplainable is encountered.\nThis was definitely a book that made sense the second time around, but not the first.",
            "goodreadsID": "95558",
            "genres": ["Sci-Fi", "Fiction", "Classics"],
            "isbn": "0571311571",
            "reviewDate": "2019-04-02"
        },
        {
            "author": "Barbara K. Lipska",
            "title": "The Neuroscientist Who Lost Her Mind",
            "year": 2018,
            "rating": 4,
            "spoilers": true,
            "thumbnail": "https://images.gr-assets.com/books/1520607734l/35721138.jpg",
            "reviewTitle": "N/A",
            "review": "N/A",
            "goodreadsID": "35721138",
            "genres": ["Nonfiction", "Autobiography", "Science", "Psychology", "Medical"],
            "isbn": "1328787303",
            "reviewDate": "2019-04-02"
        },
        {
            "author": "Theodore Schick and Lewis Vaughn",
            "title": "How to think about weird things",
            "year": 2011,
            "rating": 5,
            "spoilers": true,
            "thumbnail": "https://images.gr-assets.com/books/1169751462l/41756.jpg",
            "reviewTitle": "Critical-thinking clarity",
            "review": "<p>I used to enjoy reading some of my brother's textbooks when he was doing his Bachelor of Psychology. This one tied together a lot of ideas I had gathered intuitively through life, built upon them, and organised them into a cohesive framework. Since it is such a useful book I have taken notes on it and included them here, for personal reference.</p><p>The first 8 chapters cover the foundations of logic, argumentation, psychological biases and fallacies, using plenty of real-world case studies. The book then introduces the <b>SEARCH</b> formula - a critical thinking framework for analysing any kind of claim - ranging from mundane to paranormal:</p><ol><li><b>S</b>tate the claim as specifically as possible without using <a href=\"https://en.wikipedia.org/wiki/Weasel_word\">weasel words</a>. It is important to avoid these, since they make arguments appear specific or meaningful, while actually being ambiguous and allowing the person proposing the claim to later deny any specific meaning when the claim is challenged.</li><li><b>E</b>valuate the claim using reason and/or evidence: Did it actually happen? If not then consider why. Was the claim a sound argument? A sound argument involves premises and a conclusion that must follow solely from the premises. Premises must be known facts.</li><li>Consider <b>A</b>lternative hypotheses. Humans have a lot of inbuilt biases. For example, our brains are good at pattern recognition, but we often latch on to a pattern that seems correct without ever testing it (doing this is known as confirmation bias). We have many other kinds of biases inherent in our brains too, however this does not mean we are doomed to ignorance. There are philosophical tools we can use to overcome our biases. The best way to avoid confirmation bias is to search for disconfirming evidence. Having an open mind means being willing to consider any possibility and changing your view in light of good reasons.</li><li><b>R</b>ate, according to the <b>C</b>riteria of adequacy, each <b>H</b>ypothesis:<ul><li>Testability - can the hypothesis be tested? Is there any possible way to determine whether the hypothesis is true or false? If a claim is not testable then it does not mean its false - it means it is worthless. Hypotheses that are testable are preferable to those that are not.</li><li>Fruitfulness - Does the hypothesis yield observable surprising predictions that explain new phenomena? Those that do are preferable to those that do not.</li><li>Scope - How many different phenomena can the hypothesis explain? The more the better.</li><li>Simplicity - is the hypothesis the simplest explanation for the phenomenon? Generally, the simplest hypothesis that explains the phenomenon is the best. For a hypothesis to be the simplest then it must make the fewest assumptions.</li><li>Conservatism - Is the hypothesis consistent with well founded beliefs? I.e. is it consistent with empirical evidence and with knowledge we have from verifiable scientific experiments? If the hypothesis conflicts with a highly confirmed theory then the hypothesis must be regarded as improbable until good evidence shows that the hypothesis is right and the theory is wrong.</li></ul></li></ol><p>These 4 steps are a general guide for assessing any claim. You might not always be able to discard a claim, or to tell if a claim is definitely true, but you can always weigh it against other claims and see which one stacks up best.</p>",
            "goodreadsID": "41756",
            "genres": ["Logic", "Philosophy", "Psychology"],
            "isbn": "007287953X",
            "reviewDate": "2019-06-07"
        },
        {
            "author": "Robert Harris",
            "title": "Imperium",
            "year": 2006,
            "rating": 5,
            "spoilers": true,
            "thumbnail": "https://images.gr-assets.com/books/1442657816l/243601.jpg",
            "reviewTitle": "Ancient Roman political intruige",
            "review": "This was the first Robert Harris novel I read. Growing up I had always thought of Ancient Rome as boring - memorizing a bunch of emperors names and dates and locations where battles took place. However this book was anything but boring.",
            "goodreadsID": "243601",
            "genres": ["Fiction", "Historical"],
            "isbn": "074326603X",
            "reviewDate": "2019-03-29"
        }
    ]
}
