{"notes":"put all book data here, new reviews at the bottom, then run build_book_indexes.py","data":[{"rating":4,"genres":["Sci-Fi","Fiction","Classics"],"isbn":"0571311571","title":"Solaris","spoilers":true,"review":"Points for creativity and originality. I liked the conscious \"plasmic\" ocean concept. And the idea that an alien might not communicate with humans in a way that could ever make sense to us. Also points for character development and plot development. Snout initially appears crazy and then circumstances show him to be the sanest of them all. It was nice to have one’s prejudices conjured and then corrected and it was nicely done. I also liked the air of mystery - things left unsaid: we never learn what visitors Snout and Sartorious receive, yet we are given snippets of conversations and evidence of bloody struggles, with little said about what went down. And of course the idea of an idea becoming a material reality visible to others.\nI deducted points for a bit of a bland plot taking place all in one location (though it is a very interesting location - a foreign planet). At times it almost felt like the author was trying to be deliberately minimalistic - to see how interesting a book he could write using as little change in location and as few characters as possible.\nThe book raised some interesting philosophical questions and proposed some novel scientific methods for practically answering them - how do you know if you are dreaming? Try calculating something using a computer that would be beyond the capabilities of your brain, but easy for a computer. Though this is not foolproof since if you are dreaming you might just think the answer is correct, even if it is completely made up by your brain.\nI also deducted further points for bringing up \"god\" in the final chapter. It seemed unnecessary and corny. Snout says, \"that's bad philosophy. It's even bad mysticism\" then changes his mind. I think his original reaction was correct. Though maybe it says something about the weakness of the human mind to always fall back on the tired old trope of a god whenever some organism that is more intelligent or unexplainable is encountered.\nThis was definitely a book where it all made sense the second time around but not the first time.","author":"Stanislaw Lem","goodreadsID":"95558","reviewTitle":"Creative, minimalist sci-fi","year":1961,"thumbnail":"https://images.gr-assets.com/books/1498631519l/95558.jpg"},{"rating":4,"genres":["Nonfiction","Autobiography","Science","Psychology","Medical"],"isbn":"1328787303","title":"The Neuroscientist Who Lost Her Mind","spoilers":true,"review":"N/A","author":"Barbara K. Lipska","goodreadsID":"35721138","reviewTitle":"N/A","year":2018,"thumbnail":"https://images.gr-assets.com/books/1520607734l/35721138.jpg"},{"rating":5,"genres":["Logic","Philosophy","Psychology"],"isbn":"007287953X","title":"How to think about weird things","spoilers":true,"review":"N/A","author":"Theodore Schick and Lewis Vaughn","goodreadsID":"41756","reviewTitle":"Critical-thinking clarity","year":2011,"thumbnail":"https://images.gr-assets.com/books/1169751462l/41756.jpg"},{"rating":5,"genres":["Fiction","Historical"],"isbn":"074326603X","title":"Imperium","spoilers":true,"review":"This was the first Robert Harris novel I read. Growing up I had always thought of Ancient Rome as boring - memorizing a bunch of emperors names and dates and locations where battles took place. However this book was anything but boring.","author":"Robert Harris","goodreadsID":"243601","reviewTitle":"Ancient Roman political intruige","year":2006,"thumbnail":"https://images.gr-assets.com/books/1442657816l/243601.jpg"}]}