{"reviewFull":"My review of this movie is particularly critical because of its highly acclaimed status. The USA Library of Congress added it to their <a class=\"link-external\" href=\"https://www.loc.gov/programs/national-film-preservation-board/film-registry/complete-national-film-registry-listing/\">National Film Registry</a> in 1990 as a sample of American film heritage, and described it as a film that <a class=\"link-external\" href=\"https://www.loc.gov/programs/national-film-preservation-board/film-registry/descriptions-and-essays/\">\"spoke to a whole generation and remains wrenchingly powerful, despite some dated elements\"</a>. And <a class=\"link-external\" href=\"https://www.rottentomatoes.com/m/rebel_without_a_cause\">the critics on Rotten Tomatoes gave it 96%</a>, concluding that it \"is a searing melodrama featuring keen insight into '50s juvenile attitude and James Dean's cool, iconic performance.\" Were this not such a renowned movie then perhaps I would have looked harder for redeeming elements, but as it was, I just took it at face value.\nActing standards were definitely lower back in the 50s. Infact, of the leading roles, only James Dean (Jim) and Jim Backus (Jim's dad) can act. Not that they are brilliant actors either - they just pass as believable for the roles they are playing. The rest either overact (by being unrealistically hysterical or shouty) or come across as actors uninvolved with their role - just regurgitating their lines with no idea of what it would be like to be the character they are playing. The bad acting definitely detracted from the plot, which I found quite unique and thought-provoking.\nThe movie is a coming-of-age film in which the hero, Jim, is one of the few \"virtuous\" people in a sea of spineless phonies. His concept of virtue is clearly that of a typical 1950s man. He believes:<ul><li>in defending his honour from those who call him a coward</li><li>in facing his fears and not showing his peers that he is afraid</li><li>that a man must be the head of the household (\"...if [dad] had guts to knock Mom cold once, then maybe she'd be happy and then she'd stop pickin' on him, because they make mush out of him.\")</li><li>that the weak should be protected from predators by the strong</li><li>that people should be sincere when talking about serious matters</li><li>in taking responsibility for his own actions</li></ul>\nHe does some rebellious things too I suppose - driving a stolen car off a cliff, getting drunk as a teenager, getting into a knife fight - but these acts of rebellion are all done in furtherance of the aforelisted 1950s virtues. The word \"rebel\" can mean different things to different people, but in my view the words \"conservative\" and \"rebel\" do not belong in the same sentence. The real <i>rebel without a cause</i> in this movie is Jim's nihilistic nemesis Buzz, who goads Jim into a knife fight by stabbing his car tyre, and then challenges him to a game of \"chickie run\" (driving stolen cars off a cliff and jumping out at the last second). When Jim asks him why on earth they would want to do such a thing, Buzz carelessly replies, \"you gotta do something, dontcha?\". But Buzz is not the rebel the movie is titled after - Jim is. As the plot develops, and Jim the traditionalistic hero vanquishes Buzz the nihilist, the movie comes across as an attempt to reaffirm the social conservative values of the day, which were losing ground in the 1950s to ideas such as atheism and nihilism.\nI first watched this movie about 10 years ago, and thoroughly hated it. I just couldn't get past the bad acting, bad sound mastering, and abominable brass soundtrack. But I thought I'd better re-watch it before writing this review, just in case I missed something the first time around. This time it did keep me engaged. The ethical conundrums Jim finds himself in are gripping, so some kudos is warranted there. The movie becomes more entertaining if you think what you would do in his situation. Also, I quite enjoyed unravelling the movie's philosophy - a weird attempt to smuggle socially conservative values across as acts of rebellion. That was probably not the kind of entertainment the director had in mind for his audience, but still, it was my takeaway."}