{"reviewFull":"Acting standards were definitely lower back in the 1950s. Infact, of the leading roles, only James Dean (Jim) and Jim Backus (Jim's dad) can act. Not that they are brilliant actors either - they just pass as believable for the roles they are playing. The rest either overact (by being unrealistically hysterical or shouty) or come across as actors uninvolved with their role - just regurgitating their lines with no idea of what it would be like to be the character they are playing. And this is a shame because the plot is creative and engaging.\nIt is a coming-of-age film in which the hero, Jim, is one of the few \"virtuous\" people in a sea of spineless phonies. His concept of virtue is clearly that of a typical 1950s man. He believes:<ul><li>in defending his honour from those who call him a coward</li><li>in facing his fears with courage</li><li>that a man must be the head of the household</li><li>that the weak should be protected from predators by the strong</li><li>that people should be sincere when talking about serious matters</li></ul>\nHe does some rebellious things I suppose - driving a stolen car off a cliff, getting drunk, getting into a knife fight - but these acts of rebellion are all done in furtherance of the aforelisted 1950s virtues, which hardly seem rebellious. The movie comes across as an attempt to reaffirm conservative values, which were losing ground in the 1950s to ideas such as atheism and nihilism.\nI first watched this movie about 10 years ago, and thoroughly hated it. I just couldn't get past the bad acting, bad sound mastering, and abominable brass soundtrack. But I thought I'd better re-watch it before writing this review, just in case I missed something the first time around. This time it did keep me engaged. The ethical conundrums Jim finds himself in are gripping, and the movie becomes more entertaining if you think what you would do in his situation. Also, I quite enjoyed unravelling the movie's philosophy - a weird attempt to smuggle conservative values across as acts of rebellion. That was probably not the kind of entertainment the director had in mind for his audience, but still, it was my takeaway."}