{"reviewFull":"Japanese seem to go in for very slow paced movies. This one was too slow for me, though I did still enjoy the plot and character development. The story is of a group of 4 people living in poverty in a single room with an old lady they call Grandma, though only two of them are actually her granddaughters. One day they rescue a 5 year old girl who is sitting outside an apartment in the freezing cold. She has been abused by her parents so they decide she can live with them. They do not inform her parents and there are reports of her being kidnapped on the news. The working age adults in the family survive by working in menial jobs - construction and laundry - and supplement their income with shoplifting.\nAs the movie progresses, we see how the members of the family care for each other, which is a big contrast to the other relationships in the movie, where people are cold and distant. This part was the main vibe of the movie and I really enjoyed it - despite their shoplifting, which I do not approve of.\nGrandma eventually dies and they bury her beneath the house.\nTowards the end, the kid gets caught shoplifting and the whole family is discovered and brought in for questioning by the police.\nThis is a frustrating, but realistic part of the movie, because the police do not ask the right questions. For example, to the little girl, rather than asking, \"who would you rather live with?\" or, \"were you scared to be kidnapped?\" instead they simply assumed she would like to be reunited with her abusive parents.\nThe sister was put in prison for 5 years for incorrectly disposing of a corpse! It's called burying someone! The location should not matter, so long as it is done with love and is not going to contaminate the groundwater. Plenty of cultures do bury their relatives in the back garden, for example in the Cook Islands.\nOverall I quite enjoyed this movie - hence the the 4 stars. It had a great vibe up until the end, where it just became frustrating. But even then, it was a realistic kind of frustrating - hopefully this will challenge viewers to think critically about the system they live in."}