{"reviewFull":"I have watched all the seasons of <i>Rick and Morty</i> (as I am writing this, there are 4 seasons) and the first is still my favourite. It seems to me that the writers used up most of their creative ideas and comedy on the first season.\nLike most people who watched the show, my initial thought was that it was just going to be a parody of <i>Back to the Future</i> - because of the similarities between the characters' names - Marty and Morty, Rick and Doc Brown, and Jennifer and Jessica. But <i>Rick and Morty</i> is far more bizarre and hilarious than a simple parody of <i>Back to the Future</i> could ever be!\nManipulative alcoholic mad scientist Rick drags his cowering young grandson Morty on harrowing adventures through time and space. Rick manipulates Morty into sticking alien drugs up his butt, tells him that he has a neutrino bomb and will use it to destroy the human race, gets Morty so tired that he inadvertently fondles his (male) math teacher's chest in class, and that's all just the first episode! Apparently a lot of fans did not like the pilot but I loved the whole of this season - it hit the ground running and never slowed down. Here is the synopsis of each episode:<ol><li>Pilot - see above.</li><li>The family pet dog enslaves humanity while Rick and Morty are off <a class=\"link-external\" href=\"/movie-reviews/inception2010/\">incepting</a> Morty's math teacher so he can get an A.</li><li>Rick creates an amusement park inside the body of a hobo while Jerry's parents come over for Christmas.</li><li>Sigerian scammer aliens use a simulation to try and trick Rick into giving up his recipe for concentrated dark matter. Meanwhile Jerry has the best day of his life interacting with NPCs who he thinks are real people in the simulation running at 5% capacity.</li><li>Rick gives Beth, Jerry and Summer a box that produces a guy called Mr. Meeseeks who solves any problem he is given, while he and Morty go on an adventure to steal treasure from a giant in the clouds.</li><li>Rick makes Morty a love potion to get Jessica to fall in love with him, but the whole world ends up falling in love with Morty. Rick turns everyone into praying mantises to try and undo their infatuation but it doesn't work, so Rick and Morty permanently migrate to another dimension where their dopplegangers recently died. They have to bury them in the backyard.</li><li>Morty fathers a Gazorpazorp son with a sex robot while Rick and Summer visit the Gazorpazorp homeworlds.</li><li>Rick updates the family's cable TV with programming from every conceivable reality. They stumble upon hilarious shows such as <a class=\"link-external\" href=\"https://www.youtube.com/watch?v=t_LJtG2gXSc\">Gazorpazorpfield</a> and <a class=\"link-external\" href=\"https://www.youtube.com/watch?v=zb31ysSl13o\">Two Brothers</a>. Meanwhile the family uses goggles Rick invented to observe an alternate dimension where Jerry is a famous actor and Beth is a surgeon.</li><li>Summer gets her first job at a shop run by the Devil that stocks only cursed items and Jerry gets abducted by aliens from Pluto who want it to become a planet again.</li><li>The Transdimensional Council of Ricks haul Rick and Morty to the Citadel of Ricks to find out why 27 Ricks have been murdered. Meanwhile Jerry hangs out with a Rick from another dimension who actually likes him.</li><li>Rick, Morty and Summer throw a party while their parents go away on a Titanic-themed getaway. The episode is a loose parody of <a class=\"link-external\" href=\"/movie-reviews/riskybusiness1983/\">Risky Business</a>.</li></ol>"}